Homework/HW2/projectmanagerv2/app/controllers/projects_controller.rb

  def show
    id = params[:id] # retrieve project task ID from URI route
    @project = Project.find(id) # look up project task by unique ID
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

  def index
    @projects = Project.all
---
SELECT "projects".* FROM "projects" ORDER BY Task_Title ASC

  def create
    @project = Project.create!(params[:project])
---
INSERT INTO "projects" ("created_at", "description", "due_date", "extended_description", "title", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @project = Project.find params[:id]
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @project = Project.find params[:id]
    @project.update_attributes!(params[:project])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "projects" SET "extended_description" = 'Notes will be displayed on screen only. All team members can see all notes/updates upon logging into the system.', "user" = 'Simmons', "updated_at" = '2014-09-30 20:44:30.531303' WHERE "projects"."id" = 8

	def sortTable
		@projects = Project.order("#{params[:category]} ASC")
---
SELECT "projects".* FROM "projects" ORDER BY description ASC