Homework/HW2/projectmanagerv2/app/controllers/projects_controller.rb

  def index
    #@projects = Project.all
		@all_users = Project.all_users
		@selected_users = params[:users] || session[:users] || {}
 		category = params[:category] || session[:category]
		case category
		when "title"
			order_by_category, @title_header = {:order => :title}, "hilite"
		when "description"
			order_by_category, @details_header = {:order => :description}, "hilite"
		when "user"
			order_by_category, @user_header = {:order => :user}, "hilite"
		when "due_date"
			order_by_category, @due_date_header = {:order => :due_date}, "hilite"
		end

		if @selected_users == {}
			@selected_users = Hash[@all_users.map {|user| [user, user]}]
---
SELECT "projects".* FROM "projects" WHERE "projects"."user" IN ('Coulson', 'Fitz', 'May', 'Simmons', 'Skye', 'Ward') ORDER BY due_date