app/views/reservations/delete.html.erb

					<div class="input-label">
						<% @restaurant = Restaurant.find(@reservation.restaurant_ID) %>
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]