app/views/reservations/details.html.erb

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
---
					<div class="input-label">
						<% @restaurant = Restaurant.find(@reservation.restaurant_ID) %>