app/views/restaurants/details.html.erb

						<tbody>
							<% @reservations = Reservation.where(restaurant_ID: @restaurant.id) %>
---
SELECT "reservations".* FROM "reservations"  WHERE "reservations"."restaurant_ID" = 1