app/controllers/reservations_controller.rb

SELECT  "reservations".* FROM "reservations"  WHERE "reservations"."id" = $1 LIMIT 1  [["id", 2]]
---
  def details
    @reservation = Reservation.find(params[:id])

SELECT  "reservations".* FROM "reservations"  WHERE "reservations"."id" = $1 LIMIT 1  [["id", 1]]
---
	def delete
		@reservation = Reservation.find(params[:id])

SELECT  "reservations".* FROM "reservations"  WHERE "reservations"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "reservations" WHERE "reservations"."id" = 1
---
	def confirmDelete
		@reservation = Reservation.find(params[:id])
		@restaurant = Restaurant.find(@reservation.restaurant_ID)
		if Reservation.find(params[:id]).delete

SELECT  "reservations".* FROM "reservations"  WHERE "reservations"."id" = $1 LIMIT 1  [["id", 2]]
---
	def edit
		@reservation = Reservation.find(params[:id])

SELECT  "reservations".* FROM "reservations"  WHERE "reservations"."id" = $1 LIMIT 1  [["id", 1]]
---
	def save
		@reservation = Reservation.find(params[:reservation][:id])

INSERT INTO "reservations" ("created_at", "notes", "party_size", "reservation_date_time", "restaurant_ID", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def new
		@reservation = Reservation.new(reservation_params)
  	if @reservation.save