app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def home
    @restaurants = Restaurant.all

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
---
  def details
    @restaurant = Restaurant.find(params[:id])

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
---
	def delete
		@restaurant = Restaurant.find(params[:id])

DELETE FROM "restaurants" WHERE "restaurants"."id" = 2
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
---
	def confirmDelete
		Restaurant.find(params[:id]).delete

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]
---
	def edit
		@restaurant = Restaurant.find(params[:id])

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "restaurants" SET "address" = $1, "phone_number" = $2, "restaurant_name" = $3, "store_ID" = $4, "updated_at" = $5 WHERE "restaurants"."id" = 2  [["address", "5678 Road"], ["phone_number", "111-555-3333"], ["restaurant_name", "MacNGrill"], ["store_ID", "888"], ["updated_at", "2015-04-04 00:12:36.732788"]]
---
	def save
		@restaurant = Restaurant.find(params[:restaurant][:id])
		if @restaurant.update_attributes(restaurant_params)

INSERT INTO "restaurants" ("address", "created_at", "phone_number", "restaurant_name", "store_ID", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def new
  	@restaraunt = Restaurant.new(restaurant_params)
  	@restaraunt.save