app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 9]]
---
  def show
    @restaurant = Restaurant.find(params[:id])

INSERT INTO "restaurants" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-03-20 06:49:14.731892"], ["updated_at", "2015-03-20 06:49:14.731892"]]
---
def create
  @restaraunt = Restaurant.new(restaurant_params)

  @restaraunt.save