app/controllers/welcome_controller.rb

  def home
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"